migration/mule/web-service-consumer/resources-web-service-consumer/DMInputMappingConf_xsltStyleSheet.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><xsl:stylesheet xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:firstElementOfTheInput="root" xmlns:notXSLTCompatible="false" xmlns:own="http://ownfunction.org" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tsh="http://wso2.org/tshirt-service" xmlns:xs="http://www.w3.org/2001/XMLSchema" extension-element-prefixes="xs own notXSLTCompatible firstElementOfTheInput" version="2.0"><xsl:function name="own:setPrecision"><xsl:param name="resultString"/><xsl:param name="noOfDigits"/><xsl:if test="$noOfDigits=0"><xsl:value-of select="$resultString"/></xsl:if><xsl:if test="$noOfDigits!=0"><xsl:value-of select="own:setPrecision(concat($resultString,'0'),$noOfDigits - 1)"/></xsl:if></xsl:function><xsl:template match="/"><soapenv:Envelope><soapenv:Header><tsh:AuthenticationHeader/></soapenv:Header><soapenv:Body><tsh:OrderTshirt><size><xsl:value-of select="root/size"/></size><email><xsl:value-of select="root/email"/></email><name><xsl:value-of select="root/name"/></name><address1><xsl:value-of select="root/address1"/></address1><address2><xsl:value-of select="root/address2"/></address2><city><xsl:value-of select="root/city"/></city><stateOrProvince><xsl:value-of select="root/stateOrProvince"/></stateOrProvince><postalCode><xsl:value-of select="root/postalCode"/></postalCode><country><xsl:value-of select="root/country"/></country></tsh:OrderTshirt></soapenv:Body></soapenv:Envelope></xsl:template></xsl:stylesheet>